#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(РегистроваяТаблица) Тогда
	
		ЗаполнитьРегистровуюСтроковуюХранимуюXMLТаблицы(ТекущийОбъект);
		ПроверитьИУдалитьИзПереченяДоговоровБитыеСсылки();	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.Дата = ТекущаяДатаСеанса(); 
		Объект.Символы = "000000"; 
		Объект.Менеджер = ПараметрыСеанса.ТекущийПользователь();
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
		
	ИменаТаблиц = "РегистроваяТаблица;СтроковаяТаблица;ХранимаяТаблица;&ПереченьДоговоров;XMLТаблица";
	СвернутьИОчиститьОтПустыхСтрок(ТекущийОбъект, СтрРазделить(ИменаТаблиц, ";"));
		
	СохранитьДанныеСтроковойИХранимойТаблиц(ТекущийОбъект);
	
КонецПроцедуры 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьДанныеРегистровойТаблицы(ТекущийОбъект);
	СохранитьДанныеXMLТаблицы(ТекущийОбъект);  
	
	РаботаСФайлами.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Параметры);

КонецПроцедуры 

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьДоговоров

&НаКлиенте
Процедура ПереченьДоговоровДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	                                                                       
	СтандартнаяОбработка = Ложь;                                         
	ИР_ОбщегоНазначенияКлиент.ПроконтролироватьАктивностьДоговора(
		Новый Структура("ВыбранноеЗначение, Элемент, Имя", ВыбранноеЗначение, Элемент, "Договор"));
	      
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыРегистроваяТаблица

&НаКлиенте
Процедура РегистроваяТаблицаПриИзменении(Элемент)    
	
	УстановитьФормаБылаМодифицирована(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура РегистроваяТаблицаДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ВедомостьДата = Объект.Дата;
	Иначе	
		ВедомостьДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	
	Форма = ОткрытьФорму("Справочник.Договоры.ФормаВыбора", , Элемент);
	ЭлементОтбора = Форма.Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НачалоДействия");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = ВедомостьДата;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистроваяТаблицаДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)

	Если Не ДоговорРазрешеноПодобрать(Объект.Дата, ВыбранноеЗначение) Тогда   
		
		Текст = СтрШаблон(НСтр("ru = 'Дата начала договора %1 больше даты документ. Подбор запрещен.'"), ВыбранноеЗначение);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		
		СтандартнаяОбработка = Ложь;  
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтроковаяТаблица

&НаКлиенте
Процедура СтроковаяТаблицаПриИзменении(Элемент) 
	
	УстановитьФормаБылаМодифицирована(ЭтаФорма);    
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормыХранимаяТаблица

&НаКлиенте
Процедура ХранимаяТаблицаПриИзменении(Элемент)
	
	УстановитьФормаБылаМодифицирована(ЭтаФорма);    
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыXMLТаблица

&НаКлиенте
Процедура XMLТаблицаДоговорПриИзменении(Элемент)
	
	Договор = Элементы.XMLТаблица.ТекущиеДанные.Договор;
	Если ЗначениеЗаполнено(Договор) Тогда
		Элементы.XMLТаблица.ТекущиеДанные.УникальныйИдентификатор = Строка(Договор.УникальныйИдентификатор());
	Иначе                                                                                          
		Элементы.XMLТаблица.ТекущиеДанные.УникальныйИдентификатор = "";	                              
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы     

&НаКлиенте
Процедура ГрупповоеИзменение(Команда)
	
	ИменаТаблиц = "РегистроваяТаблица;СтроковаяТаблица;ХранимаяТаблица;&ПереченьДоговоров";
	МассивДоговоров = ВыделенныеВТаблицахДоговоры(СтрРазделить(ИменаТаблиц, ";"));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("МассивДоговоров", МассивДоговоров);
	
	ОткрытьФорму("Документ.Ведомость.Форма.ФормаГрупповогоИзмененияДоговоров", ПараметрыФормы);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтправитьМенеджеру(Команда)  
	
	ОчиститьСообщения();
	ОтправитьМенеджеруСервер();
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРегистровуюСтроковуюХранимуюXMLТаблицы(ТекущийОбъект)
	
	ЕстьУдаленныеСсылки = Ложь;
	
	// Заполнение регистровой таблицы									 											 											 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДоговоров.Договор КАК Договор,
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ДанныеДоговоров КАК ДанныеДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ДанныеДоговоров.Договор = Договоры.Ссылка
	|ГДЕ
	|	ДанныеДоговоров.Регистратор = &Регистратор";
	                                                              
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл       
		
		Если Выборка.Ссылка <> Null Тогда          
			
			СтрокаДанных = РегистроваяТаблица.Добавить();
			СтрокаДанных.Договор = Выборка.Ссылка;
			
		Иначе 
			
			ЕстьУдаленныеСсылки = Истина;
			СообщитьОбУдаленномДоговоре(Выборка.Договор);
			
		КонецЕсли;   
		
	КонецЦикла;
	
	// Заполнение строковой, хранимой и XML таблиц
	МассивСтроковыхГУИДовДоговоров = СтрРазделить(Объект.ДоговорыСтрокой, ";", Ложь);
	ТаблицаДоговоров = Новый ТаблицаЗначений();
	ТаблицаДоговоров.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаДоговоров.Колонки.Добавить("ИмяТаблицы", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(40)));
	
	Для Каждого ГУИДДоговораСтрокой Из МассивСтроковыхГУИДовДоговоров Цикл
	
		СтрокаТаблицы = ТаблицаДоговоров.Добавить();                                               
		СтрокаТаблицы.ИмяТаблицы = "СтроковаяТаблица";
		СтрокаТаблицы.Договор = XMLЗначение(Тип("СправочникСсылка.Договоры"), ГУИДДоговораСтрокой); 
	
	КонецЦикла;  
	
	ТаблицаХранилища = ТекущийОбъект.ХранилищеДоговоров.Получить();
	Если ТаблицаХранилища <> Неопределено Тогда
		Для Каждого СтрокаТаблицыХранилища Из ТаблицаХранилища Цикл
			
			СтрокаТаблицы = ТаблицаДоговоров.Добавить();                                               
			СтрокаТаблицы.ИмяТаблицы = "ХранимаяТаблица";
			СтрокаТаблицы.Договор = СтрокаТаблицыХранилища.Договор;
			
		КонецЦикла;	
	КонецЕсли;
	
	КаталогВедомостьXMLХранилище = Константы.КаталогВедомостьXMLХранилище.Получить();
	ПолныйПутьКXMLФайлу = КаталогВедомостьXMLХранилище + XMLСтрока(ТекущийОбъект.Ссылка) + ".xml"; 
	КаталогНаДиске = Новый Файл(КаталогВедомостьXMLХранилище);
	ФайлНаДиске = Новый Файл(ПолныйПутьКXMLФайлу);
	Если Не КаталогНаДиске.Существует() Тогда  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'На диске отсутствует каталог для хранения XML файлов. Чтение невозможно.'");
		Сообщение.Сообщить();
	ИначеЕсли ФайлНаДиске.Существует() Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ПолныйПутьКXMLФайлу);
		ПрочитанныеДанные = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		
		Для Каждого СтрокаXMLФайла Из ПрочитанныеДанные Цикл
		
			СтрокаТаблицы = ТаблицаДоговоров.Добавить();                                               
			СтрокаТаблицы.ИмяТаблицы = "XMLТаблица";
			СтрокаТаблицы.Договор = СтрокаXMLФайла.Договор;		
		
		КонецЦикла;
		
		ЧтениеXML.Закрыть();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Договор КАК Договор,
	|	Договоры.ИмяТаблицы КАК ИмяТаблицы
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	&ТаблицаДоговоров КАК Договоры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Договор КАК Договор,
	|	ВТ_Договоры.ИмяТаблицы КАК ИмяТаблицы,
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВТ_Договоры.Договор = Договоры.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаДоговоров", ТаблицаДоговоров);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка <> Null Тогда
			
			Если Выборка.ИмяТаблицы = "СтроковаяТаблица" Тогда  
				
				СтрокаТаблицы = СтроковаяТаблица.Добавить();
				СтрокаТаблицы.Договор = Выборка.Ссылка;     
				
			ИначеЕсли Выборка.ИмяТаблицы = "ХранимаяТаблица" Тогда 
				
				СтрокаТаблицы = ХранимаяТаблица.Добавить();
				СтрокаТаблицы.Договор = Выборка.Ссылка;     
				
			ИначеЕсли Выборка.ИмяТаблицы = "XMLТаблица" Тогда 
				
				СтрокаТаблицы = XMLТаблица.Добавить();
				СтрокаТаблицы.Договор = Выборка.Ссылка;
				СтрокаТаблицы.УникальныйИдентификатор = XMLСтрока(Выборка.Ссылка);

			КонецЕсли;                                                    
			
		Иначе 
			
			ЕстьУдаленныеСсылки = Истина;
			СообщитьОбУдаленномДоговоре(Выборка.Договор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьУдаленныеСсылки Тогда
	
		УстановитьФормаБылаМодифицирована(ЭтаФорма);	
	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ПроверитьИУдалитьИзПереченяДоговоровБитыеСсылки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьПереченьДоговоров.Договор КАК Договор,
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Ведомость.ПереченьДоговоров КАК ВедомостьПереченьДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВедомостьПереченьДоговоров.Договор = Договоры.Ссылка
	|ГДЕ
	|	ВедомостьПереченьДоговоров.Ссылка = &Ведомость";
	
	Запрос.УстановитьПараметр("Ведомость", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьУдаленныеСсылки = Ложь;
	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.Ссылка = Null Тогда
		
			ЕстьУдаленныеСсылки = Истина;
			Прервать;
		
		КонецЕсли;   
		
	КонецЦикла;
	         
	Если ЕстьУдаленныеСсылки Тогда
	
		Объект.ПереченьДоговоров.Очистить();
		Выборка.Сбросить();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Ссылка <> Null Тогда
			
				СтрокаПеречняДоговоров = Объект.ПереченьДоговоров.Добавить();
				СтрокаПеречняДоговоров.Договор = Выборка.Ссылка;
				
			Иначе 
				
				СообщитьОбУдаленномДоговоре(Выборка.Договор);
				
			КонецЕсли;
			
		КонецЦикла;
	              
		УстановитьФормаБылаМодифицирована(ЭтаФорма);
	
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура СвернутьИОчиститьОтПустыхСтрок(ТекущийОбъект, ИменаТаблиц)
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		
		Если СтрНачинаетсяС(ИмяТаблицы, "&") Тогда        
			Таблица = ТекущийОбъект[Сред(ИмяТаблицы, 2)];  
		Иначе	        
			Таблица = РеквизитФормыВЗначение(ИмяТаблицы);  
		КонецЕсли;
		
		Если Не ИмяТаблицы = "XMLТаблица" Тогда
			Таблица.Свернуть("Договор");
		Иначе	
			Таблица.Свернуть("Договор, УникальныйИдентификатор");
		КонецЕсли;
		
		Индекс = Таблица.Количество() - 1;
		Пока Индекс >= 0 Цикл
			Если Таблица[Индекс].Договор = Справочники.Договоры.ПустаяСсылка() Тогда    
				Таблица.Удалить(Таблица[Индекс]);  
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		
		Если Не СтрНачинаетсяС(ИмяТаблицы, "&") Тогда       
			ЗначениеВРеквизитФормы(Таблица, ИмяТаблицы); 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

// Записывает данные таблицы формы в регистр сведений ДанныеДоговоров 
//
&НаСервере
Процедура СохранитьДанныеРегистровойТаблицы(ТекущийОбъект)  
	
	МассивДоговоров = ИР_ОбщегоНазначенияВызовСервера.ТаблицаКолонкуВМассив(РегистроваяТаблица, "Договор");
	Документы.Ведомость.ЗаписатьВРегистровоеХранилище(ТекущийОбъект, МассивДоговоров);
	
КонецПроцедуры	

// Записывает данные таблиц формы в реквизиты документа ДоговорыСтрокой и ХранилищеДоговоров 
//
&НаСервере
Процедура СохранитьДанныеСтроковойИХранимойТаблиц(ТекущийОбъект) 
	
	МассивДоговоров = ИР_ОбщегоНазначенияВызовСервера.ТаблицаКолонкуВМассив(СтроковаяТаблица, "Договор");
	Документы.Ведомость.ЗаписатьВСтроковоеХранилище(ТекущийОбъект, МассивДоговоров); 
	
	МассивДоговоров = ИР_ОбщегоНазначенияВызовСервера.ТаблицаКолонкуВМассив(ХранимаяТаблица, "Договор");
	Документы.Ведомость.ЗаписатьВХранимоеХранилище(ТекущийОбъект, МассивДоговоров);
	
КонецПроцедуры 

// Записывает данные таблицы формы в файл XML
// Путь к файлам записывается в константу КаталогВедомостьXMLХранилище, имя файла = уникальный идентификатор Ведомости 
//
&НаСервере
Процедура СохранитьДанныеXMLТаблицы(ТекущийОбъект) 
	
	КаталогВедомостьXMLХранилище = Константы.КаталогВедомостьXMLХранилище.Получить();
	КаталогНаДиске = Новый Файл(Константы.КаталогВедомостьXMLХранилище.Получить());
	
	Если XMLТаблица.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(КаталогВедомостьXMLХранилище) И КаталогНаДиске.Существует() Тогда
		
			МассивФайлов = НайтиФайлы(КаталогВедомостьXMLХранилище + XMLСтрока(ТекущийОбъект.Ссылка) + ".xml");
			Если МассивФайлов.Количество() > 0 Тогда
			
				Попытка
					УдалитьФайлы(МассивФайлов[0].ПолноеИмя);	
				Исключение
				КонецПопытки;	
				
			КонецЕсли;
		
		КонецЕсли;
		
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КаталогВедомостьXMLХранилище) Тогда       
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Путь к каталогу XML файлов не задан. Запись невозможна.'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли; 
	
	Если Не КаталогНаДиске.Существует() Тогда  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'На диске отсутствует каталог для хранения XML файлов. Запись невозможна.'");
		Сообщение.Сообщить();  
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	&XMLТаблица КАК Договоры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.Наименование КАК Наименование
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВТ_Договоры.Договор = Договоры.Ссылка";
	
	Запрос.УстановитьПараметр("XMLТаблица", XMLТаблица.Выгрузить(, "Договор"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(КаталогВедомостьXMLХранилище + XMLСтрока(ТекущийОбъект.Ссылка) + ".xml");
		
	МассивДанных = Новый Массив();
	Пока Выборка.Следующий() Цикл
	
		ДанныеДоговора = Новый Структура();
		ДанныеДоговора.Вставить("Договор", Выборка.Договор);
		ДанныеДоговора.Вставить("Наименование", Выборка.Наименование);
		МассивДанных.Добавить(ДанныеДоговора);	
	
	КонецЦикла;	
	
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, МассивДанных, НазначениеТипаXML.Явное);
	ЗаписьXML.Закрыть(); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФормаБылаМодифицирована(ЭтаФорма)    
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоговорРазрешеноПодобрать(Дата, ВыбранноеЗначение)
	
	ДоговорРазрешеноПодобрать = Ложь;
	                    
	Если ЗначениеЗаполнено(Дата) Тогда
		ВедомостьДата = Дата;
	Иначе	
		ВедомостьДата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.НачалоДействия КАК НачалоДействия
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранноеЗначение); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Если Выборка.НачалоДействия <= ВедомостьДата Тогда
	
		ДоговорРазрешеноПодобрать = Истина;	
	
	КонецЕсли;	
	
	Возврат ДоговорРазрешеноПодобрать;

КонецФункции

&НаСервереБезКонтекста
Процедура СообщитьОбУдаленномДоговоре(Договор)
	
	Текст = СтрШаблон(НСтр("ru = 'Договор не найден в базе (%1). Загрузка невозможна.'"), Договор);
	ОбщегоНазначения.СообщитьПользователю(Текст);
	
КонецПроцедуры

// Обходит таблицы, ищет выделенные строки и возвращает указанные в строках договоры в виде массива
//
// Параметры:
//  ИменаТаблиц	- Массив - массив имен таблиц
//				Если таблица - реквизит объекта, то ее имя должна начинаться со знака "&"
//
// Возвращаемое значение:
//   Массив   	- массив значений типа СправочникСсылка.Договоры
//
&НаКлиенте
Функция ВыделенныеВТаблицахДоговоры(ИменаТаблиц)
	
	МассивВыделенныхДоговоров = Новый Массив();

	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл                       
		
		Если СтрНачинаетсяС(ИмяТаблицы, "&") Тогда   
			
			ИмяТаблицы = Сред(ИмяТаблицы, 2);
			Таблица = Объект[ИмяТаблицы];    
			
		Иначе	                           
			
			Таблица = ЭтаФорма[ИмяТаблицы]; 
			
		КонецЕсли;
		
		Для Каждого Индекс Из Элементы[ИмяТаблицы].ВыделенныеСтроки Цикл
		
			МассивВыделенныхДоговоров.Добавить(Элементы[ИмяТаблицы].ДанныеСтроки(Индекс).Договор);
		
		КонецЦикла;
		                  
	КонецЦикла;
	
	Возврат МассивВыделенныхДоговоров;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)  
	
	РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьМенеджеруСервер()  
	
	Если Не Объект.Проведен Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка: документ не проведен.'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.ПереченьДоговоров.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка: перечень договоров пуст.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Менеджер) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка: менеджер не заполнен.'"));
		Возврат;
	КонецЕсли;
	
	ПочтаОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Если Не ЗначениеЗаполнено(ПочтаОтправителя) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка: почта отправителя не определена.'"));
		Возврат;
	КонецЕсли;
	
	ПочтаПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Менеджер,
		Справочники.ВидыКонтактнойИнформации.EmailПользователя,
		ТекущаяДатаСеанса());
		
	Если Не ЗначениеЗаполнено(ПочтаПолучателя) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка: почта получателя не определена.'"));
		Возврат;
	КонецЕсли;     
	
	// Формирование вложения письма
	ТабличныйДокумент = Новый ТабличныйДокумент();
	Макет = Документы.Ведомость.ПолучитьМакет("ПФ_MXL_ВложениеМенеджеру");
	
	Запрос = Новый Запрос;                                              
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Ведомость.Ссылка) КАК ВедомостьПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Ведомость.Менеджер) КАК МенеджерПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(Договоры.Ссылка, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))) КАК ДоговорПредставление,
	|	ЕСТЬNULL(Договоры.Активен, ЛОЖЬ) КАК Активен
	|ИЗ
	|	Документ.Ведомость КАК Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Ведомость.ПереченьДоговоров КАК ВедомостьПереченьДоговоров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|			ПО ВедомостьПереченьДоговоров.Договор = Договоры.Ссылка
	|		ПО Ведомость.Ссылка = ВедомостьПереченьДоговоров.Ссылка
	|ГДЕ
	|	Ведомость.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	ВедомостьПредставление,
	|	МенеджерПредставление";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаВедомость = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВедомость.Следующий() Цикл
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(ВыборкаВедомость);              
		ТабличныйДокумент.Вывести(ОбластьШапка);
	
		ВыборкаМенеджер = ВыборкаВедомость.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаМенеджер.Следующий() Цикл
			
			Выборка = ВыборкаМенеджер.Выбрать();
			Пока Выборка.Следующий() Цикл  
				
				ОбластьПервыйПустойСтолбец = Макет.ПолучитьОбласть("Договор|ПервыйПустойСтолбец");
				ТабличныйДокумент.Вывести(ОбластьПервыйПустойСтолбец);

				ОбластьДоговорСтолбец = Макет.ПолучитьОбласть("Договор|ДоговорСтолбец");
				ОбластьДоговорСтолбец.Параметры.Заполнить(Выборка);
				Если Выборка.Активен Тогда                                                      
					ОбластьДоговорСтолбец.ТекущаяОбласть.ЦветФона = Новый Цвет(219, 228, 183);          
				Иначе	
					ОбластьДоговорСтолбец.ТекущаяОбласть.ЦветФона = Новый Цвет(228, 188, 184);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьДоговорСтолбец);
	
			КонецЦикла;
			
			ОбластьМенеджер = Макет.ПолучитьОбласть("Менеджер");
			ОбластьМенеджер.Параметры.Заполнить(ВыборкаМенеджер);              
			ТабличныйДокумент.Вывести(ОбластьМенеджер);
		КонецЦикла;
		
	КонецЦикла; 
	 
    ПолноеИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
    ТабличныйДокумент.Записать(ПолноеИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
                                                                        
    ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяВременногоФайла);  

    АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
    Попытка
    	УдалитьФайлы(ПолноеИмяВременногоФайла);	
	Исключение   
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Отправка письма: Ведомость: Ошибка'"),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.Ведомость,
			Пользователи.ТекущийПользователь(),
			СтрШаблон(НСтр("ru = 'Произошла ошибка при попытке удаления временного файла %1.'"), ПолноеИмяВременногоФайла));	
	КонецПопытки; 
	
    // Формирование и отправка письма
    Вложения = Новый Массив;
    ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", "Вложение.pdf", АдресВременногоХранилища);
    Вложения.Добавить(ОписаниеВложения);
	
    ПараметрыПисьма = Новый Структура;
    ПараметрыПисьма.Вставить("Кому", ПочтаПолучателя);
    ПараметрыПисьма.Вставить("Тема", "Тестовое письмо менеджеру");
    ПараметрыПисьма.Вставить("Тело", "Текст тестового письма");
    ПараметрыПисьма.Вставить("ТипТекста", "ПростойТекст");
    ПараметрыПисьма.Вставить("Вложения", Вложения);
                                   
	Попытка
    	
    	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтаОтправителя, ПараметрыПисьма);
    	
    	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Письмо успешно отправлено.'"));
    	
    Исключение
    	
    	ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Отправка письма: Ошибка'"),
    		УровеньЖурналаРегистрации.Ошибка,
    		Метаданные.Документы.Ведомость,
    		Пользователи.ТекущийПользователь(),
    		СтрШаблон(НСтр("ru = 'Произошла ошибка при попытке отправить письмо на почту %1.'"), ПочтаПолучателя));

    	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Произошла ошибка при попытке отправить письмо.'"));
 
    КонецПопытки;
 
КонецПроцедуры

#КонецОбласти  































