Процедура ПередЗаписью(Отказ)   
	
	КаталогВедомостьXMLХранилищеСуществующий = Константы.КаталогВедомостьXMLХранилище.Получить();
	КаталогНаДиске = Новый Файл(КаталогВедомостьXMLХранилищеСуществующий);
	Если КаталогНаДиске.Существует() Тогда  
		МассивНайденныхФайлов = НайтиФайлы(КаталогВедомостьXMLХранилищеСуществующий, "*.*", Истина);
		Если МассивНайденныхФайлов.Количество() > 0 Тогда
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Невозможно изменить текущий каталог для хранения XML файлов, пока в нем имеются файлы.'");
			Сообщение.Сообщить();
			
			Отказ = Истина;                    
			
		КонецЕсли;
	КонецЕсли;	
	
	Если СтрДлина(ЭтотОбъект.Значение) > 0 И Не СтрЗаканчиваетсяНа(ЭтотОбъект.Значение, "\") Тогда
		ЭтотОбъект.Значение = ЭтотОбъект.Значение + "\";	
	КонецЕсли;	
	
КонецПроцедуры


