#Область ПрограммныйИнтерфейс

// Контролирует активность выбранного пользователем договора
// В случае, если выбран неактивный договор, информирует пользователя и предлагает варианты замены на активный договор
// Только для события ОбработкаВыбора
//
// Параметры:
// ПараметрыДоговора - Структура - структура с параметрами договора:
//  * ВыбранноеЗначение - СправочникСсылка.Договоры - значение, изначально выбранное пользователем
//  * Элемент 			- ПолеФормы - элемент, событие которого обрабатывается в процедуре ОбработкаВыбора
//  * Имя               - Строка - (полное) имя реквизита, событие которого обрабатывается в процедуре ОбработкаВыбора
//		Если обрабатывается элемент таблицы, то достаточно имени самого реквизита, например: "Договор"
//		Если обрабатывается элемент формы, то необходимо писать его полное имя, например: "Объект.Договор"
//
// Примеры вызова процедуры:
// 
// Обработка реквизита таблицы:
// ИР_ОбщегоНазначенияКлиент.ПроконтролироватьАктивностьДоговора(
//		Новый Структура("ВыбранноеЗначение, Элемент, Имя", ВыбранноеЗначение, Элемент, "Договор"));
//
// Обработка реквизита объекта:
// ИР_ОбщегоНазначенияКлиент.ПроконтролироватьАктивностьДоговора(
//		Новый Структура("ВыбранноеЗначение, Элемент, Имя", ВыбранноеЗначение, Элемент, "Объект.Договор"));
//
// Обработка реквизита формы:
// ИР_ОбщегоНазначенияКлиент.ПроконтролироватьАктивностьДоговора(
//		Новый Структура("ВыбранноеЗначение, Элемент, Имя", ВыбранноеЗначение, Элемент, "Договор"));
//
Процедура ПроконтролироватьАктивностьДоговора(Знач ПараметрыДоговора) Экспорт

	ОчиститьСообщения();
	
	// Получение данных
	ПараметрыДоговора.Вставить("Наименование", Неопределено);
	ПараметрыДоговора.Вставить("Активен", Неопределено);
	ПараметрыДоговора.Вставить("АктивнаяЗамена", Неопределено);
	ПараметрыДоговора.Вставить("КоличествоАктивныхЗамен", Неопределено);
	ЗаполнитьЗначенияСвойств(ПараметрыДоговора, 
		ИР_ОбщегоНазначенияВызовСервера.СведенияОбАктивностиДоговора(ПараметрыДоговора.ВыбранноеЗначение));
		
	// Поиск объекта, у которого будет устанавливаться значение договора по окончанию работы оповещений
	Если ТипЗнч(ПараметрыДоговора.Элемент.Родитель) = Тип("ТаблицаФормы") Тогда         
		ПараметрыДоговора.Вставить("РодительскийОбъект", ПараметрыДоговора.Элемент.Родитель.ТекущиеДанные);
	Иначе
		КлиентскаяФорма = КлиентскаяФормаЭлемента(ПараметрыДоговора.Элемент);
		Если КлиентскаяФорма = Неопределено Тогда   
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = Ошибка: клиентская форма не определена.'"));
			Возврат;   
		Иначе	       
			ИмяСоставногоРеквизита = ПараметрыДоговора.Имя;
			МассивИменСоставногоРеквизита = СтрРазделить(ПараметрыДоговора.Имя, ".", Ложь);
			
			Счетчик = 0;
			РодительскийОбъект = КлиентскаяФорма;
			Пока Счетчик < МассивИменСоставногоРеквизита.Количество() - 1 Цикл
				РодительскийОбъект = РодительскийОбъект[МассивИменСоставногоРеквизита[Счетчик]]; 
				Счетчик = Счетчик + 1;	
			КонецЦикла;
			
			ПараметрыДоговора.Имя = МассивИменСоставногоРеквизита[МассивИменСоставногоРеквизита.Количество() - 1];
			ПараметрыДоговора.Вставить("РодительскийОбъект", РодительскийОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыДоговора.РодительскийОбъект,
		ПараметрыДоговора.Имя) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Ошибка: у родительского объекта отсутствует указанный реквизит.'"));
		Возврат;
	КонецЕсли;	
	
	// Элемент (или родитель элемента) устанавливается недоступным для предотвращения изменения его значения пользователем
	// до окончания работы оповещения
	// Если элемент - поле формы, то блокируется это поле
	// Если элемент - поле строки таблицы, то блокируется его таблица
	Если ТипЗнч(ПараметрыДоговора.Элемент.Родитель) = Тип("ТаблицаФормы") Тогда
		ПараметрыДоговора.Вставить("РодительскийЭлемент", ПараметрыДоговора.Элемент.Родитель);
	Иначе
		ПараметрыДоговора.Вставить("РодительскийЭлемент", ПараметрыДоговора.Элемент);
	КонецЕсли;
	ПараметрыДоговора.РодительскийЭлемент.Доступность = Ложь;
	
	// Отработка различных вариантов активности договора, наличия у него активных замен и решений пользователя
	Если ПараметрыДоговора.Активен Тогда   
		
		АктивностьДоговораОбработкаОтвета(КодВозвратаДиалога.Нет, ПараметрыДоговора);
		Возврат;
		
	ИначеЕсли Не ПараметрыДоговора.Активен И ПараметрыДоговора.КоличествоАктивныхЗамен = 0 Тогда
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Выбранный договор неактивен и для него не найдено активных и схожих по наименованию замен.'"));
		АктивностьДоговораОбработкаОтвета(КодВозвратаДиалога.Нет, ПараметрыДоговора);
		Возврат;
	
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("АктивностьДоговораОбработкаОтвета", ЭтотОбъект, ПараметрыДоговора);
	Если ПараметрыДоговора.КоличествоАктивныхЗамен = 1 Тогда
		ТекстВопроса = СтрШаблон(НСтр("ru = '%1%2'"),
			"Выбранный договор неактивен, но найден активный и схожий по наименованию. ",
			"Выбрать активный договор?");
	Иначе	
		ТекстВопроса = СтрШаблон(НСтр("ru = '%1%2'"),
			"Выбранный договор неактивен, но найдено несколько активных и схожих по наименованию. ",
			"Выбрать из них активный договор?");
	КонецЕсли;
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , "Выбран неактивный договор");
	    
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура АктивностьДоговораОбработкаОтвета(ОтветПользователя, ПараметрыДоговора) Экспорт
	
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		АктивностьДоговораУстановкаЗначения(ПараметрыДоговора.ВыбранноеЗначение, ПараметрыДоговора);
	ИначеЕсли ПараметрыДоговора.КоличествоАктивныхЗамен = 1 Тогда
		АктивностьДоговораУстановкаЗначения(ПараметрыДоговора.АктивнаяЗамена, ПараметрыДоговора);
	Иначе
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("АктивностьДоговораУстановкаЗначения", ЭтотОбъект, ПараметрыДоговора);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", ПараметрыДоговора.Наименование);
		Отбор.Вставить("Активен", Истина);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ОткрытьФорму("Справочник.Договоры.ФормаВыбора", ПараметрыФормы,, , , , ОповещениеОЗакрытии);	
	КонецЕсли;
	
КонецПроцедуры 

Процедура АктивностьДоговораУстановкаЗначения(ВыбранноеПользователемЗначение, ПараметрыДоговора) Экспорт
	
	// Установка значения договора
	ПараметрыДоговора.РодительскийОбъект[ПараметрыДоговора.Имя] = ВыбранноеПользователемЗначение;
	
	// Восстановление доступности элемента
	ПараметрыДоговора.РодительскийЭлемент.Доступность = Истина;
	
КонецПроцедуры

Функция КлиентскаяФормаЭлемента(Элемент, КоличествоИтераций = 0)

	Если КоличествоИтераций > 50 Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗнч(Элемент.Родитель) = Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат Элемент.Родитель;
	Иначе
		Возврат КлиентскаяФормаЭлемента(Элемент.Родитель, КоличествоИтераций + 1);
	КонецЕсли;

КонецФункции

#КонецОбласти   
























