#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДаграммуДанныхДоговоровСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьДаграммуДанныхДоговоров", 60);
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы   

&НаКлиенте
Процедура ДанныеДоговоровВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	
	Отбор = Новый Структура;
	Если ЗначениеДиаграммы.Серия.Значение = "Активные" Тогда
		Отбор.Вставить("Активен", Истина);
		Отбор.Вставить("ПометкаУдаления", Ложь);  
	ИначеЕсли ЗначениеДиаграммы.Серия.Значение = "Не активные" Тогда
		Отбор.Вставить("Активен", Ложь);
		Отбор.Вставить("ПометкаУдаления", Ложь);
	ИначеЕсли ЗначениеДиаграммы.Серия.Значение = "Удаленные" Тогда
		Отбор.Вставить("ПометкаУдаления", Истина);
	КонецЕсли;   
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.Договоры.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДаграммуДанныхДоговоровСервер()

	ДанныеДоговоров.Очистить();
                                                  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА Договоры.Активен
	|					И НЕ Договоры.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Активные,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Договоры.Активен
	|					И НЕ Договоры.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеАктивные,
	|	СУММА(ВЫБОР
	|			КОГДА Договоры.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Удаленные
	|ИЗ
	|	Справочник.Договоры КАК Договоры";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
	
		Точка = ДанныеДоговоров.УстановитьТочку("Данные договоров");    
		
		Серия = ДанныеДоговоров.УстановитьСерию("Активные");
		Серия.Цвет = WebЦвета.СинеСерый;
		ДанныеДоговоров.УстановитьЗначение(Точка, Серия, Выборка.Активные); 
		
		Серия = ДанныеДоговоров.УстановитьСерию("Не активные");
		Серия.Цвет = WebЦвета.ТемноОранжевый;
		ДанныеДоговоров.УстановитьЗначение(Точка, Серия, Выборка.НеАктивные);
		
		Серия = ДанныеДоговоров.УстановитьСерию("Удаленные");
		Серия.Цвет = WebЦвета.ТемноСерый;
		ДанныеДоговоров.УстановитьЗначение(Точка, Серия, Выборка.Удаленные);
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДаграммуДанныхДоговоров() Экспорт

	ОбновитьДаграммуДанныхДоговоровСервер();	

КонецПроцедуры

#КонецОбласти      


























