#Область ПрограммныйИнтерфейс

Функция ТаблицаКолонкуВМассив(Таблица, Колонка) Экспорт

	МассивДанных = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
	
		МассивДанных.Добавить(СтрокаТаблицы[Колонка]);	
	
	КонецЦикла;
	
	Возврат МассивДанных;

КонецФункции 

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

Функция СведенияОбАктивностиДоговора(ВыбранноеЗначение) Экспорт
	
	Сведения = Новый Структура();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка,
	|	Договоры.Активен КАК Активен,
	|	Договоры.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_Договор
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Договор КАК ВТ_Договор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВТ_Договор.Наименование = Договоры.Наименование
	|			И (Договоры.Активен = ИСТИНА)
	|			И (Договоры.Ссылка <> ВТ_Договор.Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранноеЗначение);
	
	ПакетныйРезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДоговор = ПакетныйРезультатЗапроса[0].Выбрать();
	ВыборкаДоговор.Следующий();
	Сведения.Вставить("Наименование", ВыборкаДоговор.Наименование);
	Сведения.Вставить("Активен", ВыборкаДоговор.Активен);
	
	ВыборкаАктивнаяЗамена = ПакетныйРезультатЗапроса[1].Выбрать();
	КоличествоАктивныхЗамен = ВыборкаАктивнаяЗамена.Количество();
	Сведения.Вставить("КоличествоАктивныхЗамен", КоличествоАктивныхЗамен);
	Если КоличествоАктивныхЗамен = 1 Тогда
		ВыборкаАктивнаяЗамена.Следующий();
		Сведения.Вставить("АктивнаяЗамена", ВыборкаАктивнаяЗамена.Ссылка);
	КонецЕсли;
	 
	Возврат Сведения;

КонецФункции

#КонецОбласти   





















