#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.СсылкаСуществует(Данные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Данные.Ссылка, "Активен, ОкончаниеДействия");
	
	Если Реквизиты.Активен Тогда
		Представление = Данные.Наименование + " (А)";
	Иначе	
		Представление = Данные.Наименование + " (" + Строка(Реквизиты.ОкончаниеДействия) + ")";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти