#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НачалоДействия >= ОкончаниеДействия Тогда
		
		Отказ = Истина;   
		
		Текст = НСтр("ru = 'Начало действия не может быть больше или равно окончанию действия.'");
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	КонецЕсли;
	
	Если Ссылка.Пустая() И Не ЗаписьУникальна() Тогда
	
		Отказ = Истина;
	
	КонецЕсли;  
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции   

Функция ЗаписьУникальна()
	
	ЗаписьУникальна = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Код КАК Код
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Наименование = &Наименование
	|	И Договоры.НачалоДействия = &НачалоДействия
	|	И Договоры.ОкончаниеДействия = &ОкончаниеДействия";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДействия);
	Запрос.УстановитьПараметр("ОкончаниеДействия", ОкончаниеДействия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Выборка.Следующий();
		
		ЗаписьУникальна = Ложь; 
		
		Текст = СтрШаблон(НСтр("ru = 'Ошибка записи: такой договор уже существует, код: %1.'"), Выборка.Код);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	КонецЕсли;
	
	Возврат ЗаписьУникальна;	
	
КонецФункции

#КонецОбласти

