#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Команда = ЭтаФорма.Команды.Добавить("КомандаВыгрузитьДоговоры");
	Команда.Действие = "ВыгрузитьДоговоры";
	Команда.Заголовок = "Выгрузить договоры ";
																		  
	Кнопка = ЭтаФорма.Элементы.Добавить(
		"КнопкаВыгрузитьДоговоры", 
		Тип("КнопкаФормы"),
		ЭтаФорма.КоманднаяПанель);
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Кнопка.ИмяКоманды = "КомандаВыгрузитьДоговоры";
		                    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьДоговоры()
	
	ОчиститьСообщения();
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок					= НСтр("ru = 'Выберите, куда сохранить файл'");
	Диалог.Фильтр						= НСтр("ru = 'Файл JSON (*.json)|*.json'");
	Диалог.МножественныйВыбор			= Ложь;
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОбработатьВыборПолногоИмениФайлаДоговоров", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещенияОЗавершении);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборПолногоИмениФайлаДоговоров(ПолныеИменаФайлов, ДополнительныеПараметры) Экспорт
	
	Если ПолныеИменаФайлов = Неопределено Или ПолныеИменаФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОбработатьПомещениеФайлаДоговоровКлиент", ЭтотОбъект);
	НачатьПолучениеФайлаССервера(ОписаниеОповещенияОЗавершении, ПоместитьФайлДоговоровВоВременноеХранилищеСервер(), ПолныеИменаФайлов[0]);
	
КонецПроцедуры
		
&НаСервере
Функция ПоместитьФайлДоговоровВоВременноеХранилищеСервер() 
	
    Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();  
	
	НастройкиСтруктура = Настройки.Структура;
	НастройкиСтруктура.Очистить();
	ГруппировкаКомпоновкиДанных = НастройкиСтруктура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	ВыбранноеПоле = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Наименование");
	ВыбранноеПоле = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Активен");  
	ВыбранноеПоле = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("НачалоДействия"); 
	ВыбранноеПоле = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ОкончаниеДействия"); 	
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    
    Договора = Новый ТаблицаЗначений;
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(Договора);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЗаписываемыеДанные = Новый Массив();
	Для Каждого Договор Из Договора Цикл
	
		ДанныеДоговора = Новый Структура();
		ДанныеДоговора.Вставить("Наименование", Договор.Наименование); 
		ДанныеДоговора.Вставить("Активен", Договор.Активен);
		ДанныеДоговора.Вставить("НачалоДействия", Договор.НачалоДействия);
		ДанныеДоговора.Вставить("ОкончаниеДействия", Договор.ОкончаниеДействия);
		ЗаписываемыеДанные.Добавить(ДанныеДоговора);
	
	КонецЦикла;
	
	ПолноеИмяВременногоФайла = ПолучитьИмяВременногоФайла("json");
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.ОткрытьФайл(ПолноеИмяВременногоФайла);	
	ЗаписатьJSON(ЗаписьJSON, ЗаписываемыеДанные);            
	ЗаписьJSON.Закрыть();
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяВременногоФайла);  
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Попытка
		УдалитьФайлы(ПолноеИмяВременногоФайла);	
	Исключение
	КонецПопытки;  
	
	Возврат АдресВременногоХранилища;

КонецФункции

&НаКлиенте
Процедура ОбработатьПомещениеФайлаДоговоровКлиент(ОписаниеПереданногоФайла, ДополнительныеПараметры) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	
	Если ОписаниеПереданногоФайла = Неопределено Тогда
		Сообщение.Текст = НСтр("ru = 'Неудачная попытка сохранения.'");
	Иначе	
		Сообщение.Текст = СтрШаблон(НСтр("ru = 'Успешно сохранено в: %1.'"), ОписаниеПереданногоФайла.ПолноеИмя);
	КонецЕсли;
	
	Сообщение.Сообщить(); 
			
КонецПроцедуры

#КонецОбласти       















