#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс	
	
Функция СформироватьТабличныйДокументДоговорыВедомости(ДанныеПечати) Экспорт 
                                                                            
	Макет = Документы.Ведомость.ПолучитьМакет("ПФ_MXL_ДоговорыВедомости");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	                                
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ведомость.Ссылка КАК Ведомость,
	|	Ведомость.ДоговорыСтрокой КАК ДоговорыСтрокой,
	|	Ведомость.ХранилищеДоговоров КАК ХранилищеДоговоров,
	|	Ведомость.Номер КАК Номер,
	|	Ведомость.Дата КАК Дата
	|ИЗ
	|	Документ.Ведомость КАК Ведомость
	|ГДЕ
	|	Ведомость.Ссылка В (&ДанныеПечати)";
	
	Запрос.УстановитьПараметр("ДанныеПечати", ДанныеПечати);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    ДанныеВедомостей = Новый Соответствие();                 
	ТаблицаДоговоров = Новый ТаблицаЗначений();                                                  
	ТаблицаДоговоров.Колонки.Добавить("Ведомость", Новый ОписаниеТипов("ДокументСсылка.Ведомость"));
	ТаблицаДоговоров.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаДоговоров.Колонки.Добавить("ИмяТаблицы", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(40)));
	
	Пока Выборка.Следующий() Цикл;
	
		Данные = Новый Структура();
		Данные.Вставить("Номер", Выборка.Номер);
		Данные.Вставить("Дата", Выборка.Дата);
		ДанныеВедомостей.Вставить(Выборка.Ведомость, Данные);
		
		МассивСтроковыхГУИДовДоговоров = СтрРазделить(Выборка.ДоговорыСтрокой, ";", Ложь); 
		Для Каждого ГУИДДоговораСтрокой Из МассивСтроковыхГУИДовДоговоров Цикл
			
			Попытка
				ДоговорСсылка = XMLЗначение(Тип("СправочникСсылка.Договоры"), ГУИДДоговораСтрокой);	
			Исключение
				Продолжить;
			КонецПопытки;
			
			СтрокаТаблицы = ТаблицаДоговоров.Добавить();
			СтрокаТаблицы.Ведомость = Выборка.Ведомость;
			СтрокаТаблицы.Договор = ДоговорСсылка;                                            
			СтрокаТаблицы.ИмяТаблицы = "СтроковаяТаблица";                                              
		
		КонецЦикла;  
		
		ТаблицаХранилища = Выборка.ХранилищеДоговоров.Получить();    
		Для Каждого СтрокаТаблицыХранилища Из ТаблицаХранилища Цикл
			
			Если Не ТипЗнч(СтрокаТаблицыХранилища.Договор) = Тип("СправочникСсылка.Договоры") Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы = ТаблицаДоговоров.Добавить();
			СтрокаТаблицы.Ведомость = Выборка.Ведомость;
			СтрокаТаблицы.Договор = СтрокаТаблицыХранилища.Договор;   
			СтрокаТаблицы.ИмяТаблицы = "ХранимаяТаблица";  
		КонецЦикла;      
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДоговоров.Ведомость КАК Ведомость,
	|	ТаблицаДоговоров.Договор КАК Договор,
	|	ТаблицаДоговоров.ИмяТаблицы КАК ИмяТаблицы
	|ПОМЕСТИТЬ ВТ_ДоговорыСтрокиИХранилищаНепроверенные
	|ИЗ
	|	&ТаблицаДоговоров КАК ТаблицаДоговоров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыСтрокиИХранилищаНепроверенные.Ведомость КАК Ведомость,
	|	ВТ_ДоговорыСтрокиИХранилищаНепроверенные.Договор КАК Договор,
	|	ВТ_ДоговорыСтрокиИХранилищаНепроверенные.ИмяТаблицы КАК ИмяТаблицы
	|ПОМЕСТИТЬ ВТ_ДоговорыСтрокиИХранилища
	|ИЗ
	|	ВТ_ДоговорыСтрокиИХранилищаНепроверенные КАК ВТ_ДоговорыСтрокиИХранилищаНепроверенные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВТ_ДоговорыСтрокиИХранилищаНепроверенные.Договор = Договоры.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыСтрокиИХранилища.Ведомость КАК Ведомость,
	|	ВТ_ДоговорыСтрокиИХранилища.Договор КАК Договор,
	|	ВТ_ДоговорыСтрокиИХранилища.ИмяТаблицы КАК ИмяТаблицы,
	|	ЕСТЬNULL(Договоры.Код, """") КАК Код,
	|	Договоры.Активен КАК Активен,
	|	РАЗНОСТЬДАТ(ЕСТЬNULL(Договоры.НачалоДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ЕСТЬNULL(Договоры.ОкончаниеДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ) + 1 КАК ДлительностьДоговора,
	|	ЕСТЬNULL(Договоры.ОкончаниеДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ОкончаниеДействия
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	ВТ_ДоговорыСтрокиИХранилища КАК ВТ_ДоговорыСтрокиИХранилища
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВТ_ДоговорыСтрокиИХранилища.Договор = Договоры.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДоговоров.Регистратор,
	|	Договоры.Ссылка,
	|	""РегистроваяТаблица"",
	|	ЕСТЬNULL(Договоры.Код, """"),
	|	Договоры.Активен,
	|	РАЗНОСТЬДАТ(ЕСТЬNULL(Договоры.НачалоДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ЕСТЬNULL(Договоры.ОкончаниеДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ) + 1,
	|	ЕСТЬNULL(Договоры.ОкончаниеДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|ИЗ
	|	РегистрСведений.ДанныеДоговоров КАК ДанныеДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ДанныеДоговоров.Договор = Договоры.Ссылка
	|ГДЕ
	|	ДанныеДоговоров.Регистратор В(&ДанныеПечати)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьПереченьДоговоров.Ссылка,
	|	Договоры.Ссылка,
	|	""ПереченьДоговоров"",
	|	ЕСТЬNULL(Договоры.Код, """"),
	|	Договоры.Активен,
	|	РАЗНОСТЬДАТ(ЕСТЬNULL(Договоры.НачалоДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ЕСТЬNULL(Договоры.ОкончаниеДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ) + 1,
	|	ЕСТЬNULL(Договоры.ОкончаниеДействия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|ИЗ
	|	Документ.Ведомость.ПереченьДоговоров КАК ВедомостьПереченьДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВедомостьПереченьДоговоров.Договор = Договоры.Ссылка
	|ГДЕ
	|	ВедомостьПереченьДоговоров.Ссылка В(&ДанныеПечати)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ведомость,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Ведомость КАК Ведомость,
	|	ВТ_Договоры.Договор КАК Договор,
	|	ВТ_Договоры.ИмяТаблицы КАК ИмяТаблицы,
	|	ВТ_Договоры.Код КАК Код,
	|	ВТ_Договоры.Активен КАК Активен,
	|	ВТ_Договоры.ДлительностьДоговора КАК ДлительностьДоговора
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|ИТОГИ ПО
	|	Ведомость,
	|	ИмяТаблицы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Ведомость КАК Ведомость,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Договоры.Договор) КАК КоличествоРазличных
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Договоры.Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Ведомость КАК Ведомость,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Договоры.Договор) КАК КоличествоРазличныхДействующих,
	|	МАКСИМУМ(ВТ_Договоры.ОкончаниеДействия) КАК ОкончаниеДействия
	|ПОМЕСТИТЬ ВТ_ПоздниеДействующиеДоговоры
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|ГДЕ
	|	ВТ_Договоры.Активен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Договоры.Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоздниеДействующиеДоговоры.Ведомость КАК Ведомость,
	|	МАКСИМУМ(ВТ_ПоздниеДействующиеДоговоры.ОкончаниеДействия) КАК СамыеПоздние,
	|	ВТ_Договоры.Код КАК Код
	|ИЗ
	|	ВТ_ПоздниеДействующиеДоговоры КАК ВТ_ПоздниеДействующиеДоговоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Договоры КАК ВТ_Договоры
	|		ПО ВТ_ПоздниеДействующиеДоговоры.Ведомость = ВТ_Договоры.Ведомость
	|			И ВТ_ПоздниеДействующиеДоговоры.ОкончаниеДействия = ВТ_Договоры.ОкончаниеДействия
	|			И (ВТ_Договоры.Активен = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоздниеДействующиеДоговоры.Ведомость,
	|	ВТ_Договоры.Код";
	                                                  
	Запрос.УстановитьПараметр("ТаблицаДоговоров", ТаблицаДоговоров);
	Запрос.УстановитьПараметр("ДанныеПечати", ДанныеПечати);
			
	ПервыйДокумент = Ложь;
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	                               
	ВыборкаВедомость = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВедомость.Следующий() Цикл
		
		Если ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		                                
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
		ОбластьШапка.Параметры.Номер = ДанныеВедомостей[ВыборкаВедомость.Ведомость].Номер;	
		ОбластьШапка.Параметры.Дата = Формат(ДанныеВедомостей[ВыборкаВедомость.Ведомость].Дата, "ДФ=dd.MM.yyyy");
		      
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ЕстьРегистроваяТаблица = Ложь;
		ЕстьСтроковаяТаблица = Ложь;
		ЕстьХранимаяТаблица = Ложь;
		ЕстьПереченьДоговоров = Ложь;
		ТабличнаяРегистроваяТаблица = Новый ТабличныйДокумент;
		ТабличнаяСтроковаяТаблица = Новый ТабличныйДокумент;
		ТабличнаяХранимаяТаблица = Новый ТабличныйДокумент;
		ТабличныйПереченьДоговоров = Новый ТабличныйДокумент;
		ОбластьТаблицаПустаяСтрока = Макет.ПолучитьОбласть("ТаблицаПустаяСтрока");
		
		ВыборкаТаблица = ВыборкаВедомость.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТаблица.Следующий() Цикл 
			    			
			Выборка = ВыборкаТаблица.Выбрать();
			
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("ИмяТаблицы", "РегистроваяТаблица"); 	
			Пока Выборка.НайтиСледующий(СтруктураОтбора) Цикл
				ВывестиВоВложенныйТабличныйДокумент(Макет,
				Выборка,
				ЕстьРегистроваяТаблица,
				"РегистроваяТаблицаШапка",
				ТабличнаяРегистроваяТаблица);
			КонецЦикла;
			
			СтруктураОтбора.Вставить("ИмяТаблицы", "СтроковаяТаблица");
			Пока Выборка.НайтиСледующий(СтруктураОтбора) Цикл
				ВывестиВоВложенныйТабличныйДокумент(Макет, Выборка, ЕстьСтроковаяТаблица, "СтроковаяТаблицаШапка", ТабличнаяСтроковаяТаблица);
			КонецЦикла;
			
			СтруктураОтбора.Вставить("ИмяТаблицы", "ХранимаяТаблица");
			Пока Выборка.НайтиСледующий(СтруктураОтбора) Цикл
				ВывестиВоВложенныйТабличныйДокумент(Макет, Выборка, ЕстьХранимаяТаблица, "ХранимаяТаблицаШапка", ТабличнаяХранимаяТаблица);
			КонецЦикла;
			
			СтруктураОтбора.Вставить("ИмяТаблицы", "ПереченьДоговоров");	
			Пока Выборка.НайтиСледующий(СтруктураОтбора) Цикл
				ВывестиВоВложенныйТабличныйДокумент(Макет, Выборка, ЕстьПереченьДоговоров, "ПереченьДоговоровШапка", ТабличныйПереченьДоговоров);
			КонецЦикла;

		КонецЦикла;
		
		Если ЕстьРегистроваяТаблица Или ЕстьСтроковаяТаблица Или ЕстьХранимаяТаблица Или ЕстьПереченьДоговоров Тогда
			ОбластьТаблицаОтступСлева = Макет.ПолучитьОбласть("ТаблицаОтступСлева"); 
			ТабличныйДокумент.Вывести(ОбластьТаблицаОтступСлева); 	
		КонецЕсли;
		
		Если ЕстьРегистроваяТаблица Тогда
			ТабличныйДокумент.Присоединить(ТабличнаяРегистроваяТаблица);
		КонецЕсли; 
		Если ЕстьСтроковаяТаблица Тогда
			ТабличныйДокумент.Присоединить(ТабличнаяСтроковаяТаблица);	
		КонецЕсли;
		Если ЕстьХранимаяТаблица Тогда
			ТабличныйДокумент.Присоединить(ТабличнаяХранимаяТаблица);	
		КонецЕсли;
		Если ЕстьПереченьДоговоров Тогда
			ТабличныйДокумент.Присоединить(ТабличныйПереченьДоговоров);	
		КонецЕсли;
		
		КоличествоПустыхТаблиц = 0;
		Если Не ЕстьРегистроваяТаблица Тогда
			КоличествоПустыхТаблиц = КоличествоПустыхТаблиц + 1;
		КонецЕсли; 
		Если Не ЕстьСтроковаяТаблица Тогда
			КоличествоПустыхТаблиц = КоличествоПустыхТаблиц + 1;
		КонецЕсли;
		Если Не ЕстьХранимаяТаблица Тогда
			КоличествоПустыхТаблиц = КоличествоПустыхТаблиц + 1;
		КонецЕсли;
		Если Не ЕстьПереченьДоговоров Тогда
			КоличествоПустыхТаблиц = КоличествоПустыхТаблиц + 1;
		КонецЕсли;
		Если КоличествоПустыхТаблиц > 0 Тогда
			Для Счетчик = 1 По КоличествоПустыхТаблиц Цикл
				ТабличныйДокумент.Присоединить(ОбластьТаблицаПустаяСтрока);	
			КонецЦикла;
		КонецЕсли;

		ВедомостьИтоговыеДанные = Новый Структура();                                            
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Ведомость", ВыборкаВедомость.Ведомость);
		
		Выборка = РезультатЗапроса[4].Выбрать();        
		Выборка.НайтиСледующий(СтруктураОтбора);
		ВедомостьИтоговыеДанные.Вставить("КоличествоРазличных",
			Выборка.КоличествоРазличных);
			
		Выборка = РезультатЗапроса[5].Выбрать();        
		Выборка.НайтиСледующий(СтруктураОтбора);
		ВедомостьИтоговыеДанные.Вставить("КоличествоРазличныхДействующих",
			Выборка.КоличествоРазличныхДействующих);
			
		Выборка = РезультатЗапроса[6].Выбрать();        
		СамыеПоздниеНомераСДатой = "";
		СамаяПоздняяДатаОкончания = "";
		Пока Выборка.НайтиСледующий(СтруктураОтбора) Цикл
			
			Если Не ЗначениеЗаполнено(СамаяПоздняяДатаОкончания) Тогда
				СамаяПоздняяДатаОкончания = Формат(Выборка.СамыеПоздние, "ДФ=dd.MM.yyyy"); 	
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СамыеПоздниеНомераСДатой) Тогда
				СамыеПоздниеНомераСДатой = СамыеПоздниеНомераСДатой + "Договор №" + УбратьЛидирующиеНули(Выборка.Код);	
			Иначе
				СамыеПоздниеНомераСДатой = СамыеПоздниеНомераСДатой + ", Договор №" + УбратьЛидирующиеНули(Выборка.Код);	
			КонецЕсли;
			
		КонецЦикла;
		Если ЗначениеЗаполнено(СамыеПоздниеНомераСДатой) Тогда
			СамыеПоздниеНомераСДатой = СтрШаблон("%1 (%2)", СамыеПоздниеНомераСДатой, СамаяПоздняяДатаОкончания);	
		КонецЕсли;
		ВедомостьИтоговыеДанные.Вставить("СамыеПоздниеНомераСДатой",
			СамыеПоздниеНомераСДатой);
			
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	    ПодвалПомещается = ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал);
		Если Не ПодвалПомещается Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьПодвалПриписка = Макет.ПолучитьОбласть("ПодвалПриписка");
			ОбластьПодвалПриписка.Параметры.Заполнить(ДанныеВедомостей[ВыборкаВедомость.Ведомость]);
			ТабличныйДокумент.Вывести(ОбластьПодвалПриписка); 	
		КонецЕсли;
		ОбластьПодвал.Параметры.Заполнить(ВедомостьИтоговыеДанные);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		                                                        
		
		ПервыйДокумент = Истина;
		       
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УбратьЛидирующиеНули(Знач ЧислоСтрокой)
	
	Если СтрНачинаетсяС(ЧислоСтрокой, "0") И СтрДлина(ЧислоСтрокой) > 1 Тогда
		Возврат УбратьЛидирующиеНули(Сред(ЧислоСтрокой, 2));
	КонецЕсли;
	
	Возврат ЧислоСтрокой;

КонецФункции

Функция ДлительностьВДнях(ЧислоДней)

	СтрокиПрописи = СтрРазделить(ЧислоПрописью(ЧислоДней, "Л=ru_RU; НП=Истина, НД=Истина", "день,дня,дней,м,,,,, 0"), " ", Ложь);
	Возврат "" + ЧислоДней + " " + СтрокиПрописи[СтрокиПрописи.Количество()-1]; 

КонецФункции

Процедура ВывестиВоВложенныйТабличныйДокумент(Макет, Выборка, ЕстьТаблица, ИмяОбластиШапкиТаблицы, ВложенныйТабличныйДокумент) 
	
	Если Не ЕстьТаблица Тогда
		ОбастьРегистроваяТаблицаШапка = Макет.ПолучитьОбласть(ИмяОбластиШапкиТаблицы);
    	ВложенныйТабличныйДокумент.Вывести(ОбастьРегистроваяТаблицаШапка);	  
		ОбастьТаблицаСтрокаШапка = Макет.ПолучитьОбласть("ТаблицаСтрокаШапка");
    	ВложенныйТабличныйДокумент.Вывести(ОбастьТаблицаСтрокаШапка);				
	КонецЕсли;

	ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ТаблицаСтрока");
	ОбластьТаблицаСтрока.Параметры.Заполнить(Выборка);  
	ОбластьТаблицаСтрока.Параметры.Длительность = ДлительностьВДнях(Выборка.ДлительностьДоговора);
	ОбластьТаблицаСтрока.Параметры.ДоговорСНомером = "Договор №" + УбратьЛидирующиеНули(Выборка.Код);
	ВложенныйТабличныйДокумент.Вывести(ОбластьТаблицаСтрока);
	
	ЕстьТаблица = Истина;    
	
КонецПроцедуры

Функция ЗаписатьВРегистровоеХранилище(ВедомостьОбъект, МассивДоговоров) Экспорт
	
	ЕстьОшибкаЗаписи = Ложь;

	НаборЗаписей = РегистрыСведений.ДанныеДоговоров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ВедомостьОбъект.Ссылка);	
	
	Для Каждого Договор Из МассивДоговоров Цикл
	
		Запись = НаборЗаписей.Добавить();    
		Запись.Период = ВедомостьОбъект.Дата;
		Запись.Договор = Договор;	
	                 
	КонецЦикла;      
		                           
	Попытка   
		
		НаборЗаписей.Записать(); 
			
	Исключение
		
		ЕстьОшибкаЗаписи = Истина;
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Неудачная попытка сохранения данных в регистр.'"));
	
	КонецПопытки;
	
	Возврат ЕстьОшибкаЗаписи;
	
КонецФункции

Процедура ЗаписатьВСтроковоеХранилище(ВедомостьОбъект, МассивДоговоров) Экспорт
	
	ВСтрокуБылДобавленДоговор = Ложь;
	Если МассивДоговоров.Количество() > 0 Тогда
	
		Для Каждого Договор Из МассивДоговоров Цикл          
			
			Если ВСтрокуБылДобавленДоговор Тогда
				ВедомостьОбъект.ДоговорыСтрокой = СтрШаблон("%1;%2", ВедомостьОбъект.ДоговорыСтрокой, XMLСтрока(Договор)); 
			Иначе	
				ВедомостьОбъект.ДоговорыСтрокой = СтрШаблон("%2", ВедомостьОбъект.ДоговорыСтрокой, XMLСтрока(Договор));
				ВСтрокуБылДобавленДоговор = Истина;
			КонецЕсли;
			
		КонецЦикла;   
		
	Иначе 
		
		ВедомостьОбъект.ДоговорыСтрокой = "";	
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьВХранимоеХранилище(ВедомостьОбъект, МассивДоговоров) Экспорт
	
	ТаблицаХранилища = Новый ТаблицаЗначений();
	ТаблицаХранилища.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	Для Каждого Договор Из МассивДоговоров Цикл 
		
		СтрокаТаблицыХранилища = ТаблицаХранилища.Добавить();
		СтрокаТаблицыХранилища.Договор = Договор;
		
	КонецЦикла; 
	
	ВедомостьОбъект.ХранилищеДоговоров = Новый ХранилищеЗначения(ТаблицаХранилища, Новый СжатиеДанных());
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли







































