//новый релиз

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Найти(Символы, "&") Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В записи отказано - введен недопустимый символ: &'"));
		
		Отказ = Истина;
	КонецЕсли;
	
	ТаблицаХранилища = ХранилищеДоговоров.Получить();
	Если Не ТипЗнч(ТаблицаХранилища) = Тип("ТаблицаЗначений") Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В записи отказано - неверный тип данных хранилища договоров.'"));
		
		Отказ = Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Регистр накопления СимволыВедомости
	ТаблицаСимволов = Новый ТаблицаЗначений();
	ШестизначноеЧислоТип = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(6, 0)); 
	ТаблицаСимволов.Колонки.Добавить("ПорядковыйНомерСимвола", ШестизначноеЧислоТип);
	ТаблицаСимволов.Колонки.Добавить("Количество", ШестизначноеЧислоТип);
	ДопутимыеСимволы = Константы.ДопустимыеСимволыВедомости.Получить();
	
	Счетчик = 1;
	Для Счетчик = 1 По СтрДлина(Символы) Цикл
		Символ = НРег(Сред(Символы, Счетчик, 1));
		ДанныеСимвола = ТаблицаСимволов.Добавить();
		Если Найти(ДопутимыеСимволы, Символ) Тогда
			ДанныеСимвола.ПорядковыйНомерСимвола = КодСимвола(Символ, 1); 
		Иначе
			ДанныеСимвола.ПорядковыйНомерСимвола = КодСимвола("&", 1);
		КонецЕсли;
		ДанныеСимвола.Количество = 1;
	КонецЦикла;
	ДвиженияСимволов = Движения.СимволыВедомости;	
    ТаблицаСимволов.Свернуть("ПорядковыйНомерСимвола", "Количество");
	ТаблицаСимволов.Сортировать("ПорядковыйНомерСимвола Возр");
	
	ДвиженияСимволов.Записывать = Истина;
	ДатаСеанса = ТекущаяДатаСеанса(); 
	Для Каждого ДанныеСимвола Из ТаблицаСимволов Цикл
		Движение = ДвиженияСимволов.Добавить();
		Движение.Период = ДатаСеанса;
		Движение.Символ = Символ(ДанныеСимвола.ПорядковыйНомерСимвола);
		Движение.Количество = ДанныеСимвола.Количество;  
		Движение.Количество = Комментарий; 
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КаталогВедомостьXMLХранилище = Константы.КаталогВедомостьXMLХранилище.Получить();
	ПолныйПутьКXMLФайлу = КаталогВедомостьXMLХранилище + XMLСтрока(ЭтотОбъект.Ссылка) + ".xml"; 
	КаталогНаДиске = Новый Файл(КаталогВедомостьXMLХранилище);
	ФайлНаДиске = Новый Файл(ПолныйПутьКXMLФайлу);
	Если КаталогНаДиске.Существует() И ФайлНаДиске.Существует() Тогда
		 
		Попытка
			УдалитьФайлы(ПолныйПутьКXMLФайлу);	
		Исключение
		КонецПопытки;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
            
#КонецЕсли