#Область ПрограммныйИнтерфейс

Процедура АктуализацияДействующихДоговоров() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка,
	|	Договоры.Активен КАК Активен,
	|	Договоры.ОкончаниеДействия КАК ОкончаниеДействия,
	|	Договоры.Код КАК Код
	|ИЗ
	|	Справочник.Договоры КАК Договоры";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Активен И Выборка.ОкончаниеДействия < ТекущаяДатаСеанса() Тогда

			ДоговорОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДоговорОбъект.Активен = Ложь;
			                 
			Попытка             
				
				ДоговорОбъект.Заблокировать();
				ДоговорОбъект.Записать(); 
				                       
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Изменение: Договоры'"),
					УровеньЖурналаРегистрации.Информация,
					Метаданные.Справочники.Договоры,
					Пользователи.ТекущийПользователь(),
					СтрШаблон(НСтр("ru = 'Произведена актуализация записи справочника Договоры, код: %1'"), Выборка.Код));
			
			Исключение
					
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Изменение: Договоры: Ошибка'"),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.Договоры,
					Пользователи.ТекущийПользователь(),
					СтрШаблон(НСтр("ru = 'Произошла ошибка при попытке актуализации записи справочника Договоры, код: %1'"), Выборка.Код));	
					
			КонецПопытки;
		
		КонецЕсли;
		
	КонецЦикла;
                   
КонецПроцедуры

#КонецОбласти


