#Область ОбработчикиСобытийФормы      

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Активен = Истина;
		
	Если Параметры.Свойство("МассивДоговоров") Тогда
		
		 ЗаполнитьТаблицуДоговоровНачальнымиДанными(Параметры.МассивДоговоров);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ИзменитьДоговоры(Команда) 
	
	ОчиститьСообщения();
	
	УстанавливатьНачалоДействия = Истина;
	Если Не ЗначениеЗаполнено(НачалоДействия) Тогда
		
		Обещание = ВопросАсинх(НСтр("ru='Установить в качестве начала действия 01.01.0001?'"), РежимДиалогаВопрос.ДаНет);
		Результат = Ждать Обещание;
		
		Если Результат = КодВозвратаДиалога.Нет Тогда
		
			УстанавливатьНачалоДействия = Ложь;		
		
		КонецЕсли;

	КонецЕсли;
	
	ИзменитьДоговорыСервер(УстанавливатьНачалоДействия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДоговоровНачальнымиДанными(МассивДоговоров);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Договор,
		|	Договоры.Активен КАК Активен
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Ссылка В(&МассивДоговоров)";
	
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = ВыбранныеДоговоры.Добавить();
		СтрокаТаблицы.Договор = Выборка.Договор;
		СтрокаТаблицы.Активен = Выборка.Активен;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоговорыСервер(УстанавливатьНачалоДействия)
	
	Если НачалоДействия >= ОкончаниеДействия Тогда
		
		Текст = СтрШаблон(НСтр("ru = 'Начало действия не может быть больше или равно окончанию действия.'")); 	
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
		Возврат;
	
	КонецЕсли;
	
	МассивТекстовСообщений = Новый Массив();
	ВТранзакцииПроизошлаОшибка = Ложь;
	
	Если ВТранзакции Тогда
		НачатьТранзакцию();	
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ВыбранныеДоговоры Цикл
		
		Если Не СтрокаТаблицы.Активен Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		ДоговорОбъект = СтрокаТаблицы.Договор.ПолучитьОбъект();
		ДоговорОбъект.Активен = Активен;
		Если УстанавливатьНачалоДействия Тогда
			ДоговорОбъект.НачалоДействия = НачалоДействия;
		КонецЕсли;
		ДоговорОбъект.ОкончаниеДействия = ОкончаниеДействия;
		
		Попытка
			                
			ДоговорОбъект.Записать();   
			
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1: изменение записи справочника Договоры.'"),
				СтрокаТаблицы.Договор);
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Изменение: Договоры'"),
				УровеньЖурналаРегистрации.Информация,
				Метаданные.Справочники.Договоры,
				Пользователи.ТекущийПользователь(),
				ТекстСообщения);
			
		Исключение
			
			Если ВТранзакции Тогда 
				
				ОтменитьТранзакцию();
				
			КонецЕсли;     
			                                        
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1: ошибка записи: %2.'"),
				СтрокаТаблицы.Договор,
				ОписаниеИзначальнойОшибки(ИнформацияОбОшибке()));
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Изменение: Договоры: Ошибка'"),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.Договоры,
				Пользователи.ТекущийПользователь(),
				ТекстСообщения);
				
			МассивТекстовСообщений.Добавить(ТекстСообщения);
			
			Если ВТранзакции Тогда    
				
				ВТранзакцииПроизошлаОшибка = Истина;
				Прервать;
				
			Иначе    
				
				Продолжить;   
				
			КонецЕсли;
			
		КонецПопытки;
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДоговорОбъект);
		
		Текст = СтрШаблон(НСтр("ru = '%1: успешно изменен.'"), СтрокаТаблицы.Договор);
		МассивТекстовСообщений.Добавить(ТекстСообщения);
	
	КонецЦикла;
	
	Если ВТранзакции Тогда     
		
		Если ВТранзакцииПроизошлаОшибка Тогда   
			
			Если МассивТекстовСообщений.Количество() > 0 Тогда
				ТекстСообщения = МассивТекстовСообщений[МассивТекстовСообщений.Количество() - 1];
			Иначе
				ТекстСообщения = "Ошибка записи в транзакции."
			КонецЕсли;
			
			ВызватьИсключение(ТекстСообщения);   
			
		Иначе                   
			
			ЗафиксироватьТранзакцию();  
			
		КонецЕсли;  
		
	КонецЕсли;
	
	Для Каждого ТекстСообщения Из МассивТекстовСообщений Цикл   
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЦикла;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеИзначальнойОшибки(ИнформацияОбОшибке, УровеньВложенности = 10)
	
	Если ТипЗнч(ИнформацияОбОшибке) <> Тип("ИнформацияОбОшибке") Тогда
	
		Возврат Неопределено;
	
	КонецЕсли;

	Если ИнформацияОбОшибке.Причина = Неопределено Или УровеньВложенности <= 0 Тогда
	
		Возврат ИнформацияОбОшибке.Описание;
		
	Иначе
		
		Описание = ОписаниеИзначальнойОшибки(ИнформацияОбОшибке.Причина, УровеньВложенности - 1);	
	
	КонецЕсли;
	
	Возврат Описание;

КонецФункции

#КонецОбласти









































