&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура УказатьСтрануДоговораПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Асинх Процедура УправлениеВидимостью()
	
	Если Не Объект.УказатьСтрануДоговора И ЗначениеЗаполнено(Объект.СтранаДоговора) Тогда
		Обещание = Ждать ВопросАсинх("Указаная страна договора будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Не Обещание = КодВозвратаДиалога.Да Тогда
			Объект.УказатьСтрануДоговора = Истина;
			Возврат;
		Иначе
			Объект.СтранаДоговора = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
		
	Элементы.СтранаДоговора.Видимость = Объект.УказатьСтрануДоговора;

КонецПроцедуры
